app/Models/OfficerModel.php

SELECT *
FROM `officer`
---
	public function getAllOfficers(){
		$db = db_connect();
		$builder = $db->table('officer');
		$builder->select('*');
		$records = $builder->get();